In [1]:
%load_ext sql
%sql sqlite:///databases/mydb.db

In [2]:
%%sql

CREATE TABLE Fam(Name TEXT, Age INTEGER, Profession TEXT, Major TEXT);
INSERT INTO Fam (Name, Age) VALUES('Pam', 50);
INSERT INTO Fam (Name, Age) VALUES('Miranda', 32);
INSERT INTO Fam (Name, Age) VALUES('Pascal', 45);
INSERT INTO Fam (Name, Age) VALUES('Dave', 12);
INSERT INTO Fam (Name, Age) VALUES('Emmy', 23);

 * sqlite:///databases/mydb.db
(sqlite3.OperationalError) table Fam already exists
[SQL: CREATE TABLE Fam(Name TEXT, Age INTEGER, Profession TEXT, Major TEXT);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [3]:
%%sql

SELECT * FROM Fam

 * sqlite:///databases/mydb.db
Done.

[('Pam', 50, 'Unknown', 'Unknown'),
 ('Miranda', 32, 'Unknown', 'Unknown'),
 ('Pascal', 45, 'Unknown', 'Unknown'),
 ('Dave', 12, 'Unknown', 'Unknown'),
 ('Emmy', 23, 'Unknown', 'Unknown')]

In [4]:
%sql UPDATE Fam SET Profession='Unknown' WHERE Profession ISNULL

 * sqlite:///databases/mydb.db
0 rows affected.

[]

In [5]:
%%sql

SELECT * FROM Fam

 * sqlite:///databases/mydb.db
Done.

[('Pam', 50, 'Unknown', 'Unknown'),
 ('Miranda', 32, 'Unknown', 'Unknown'),
 ('Pascal', 45, 'Unknown', 'Unknown'),
 ('Dave', 12, 'Unknown', 'Unknown'),
 ('Emmy', 23, 'Unknown', 'Unknown')]

In [6]:
var = 'Unknown'
%sql UPDATE Fam SET Major=:var WHERE Major ISNULL

 * sqlite:///databases/mydb.db
0 rows affected.

[]

In [7]:
%%sql

SELECT * FROM Fam

 * sqlite:///databases/mydb.db
Done.

[('Pam', 50, 'Unknown', 'Unknown'),
 ('Miranda', 32, 'Unknown', 'Unknown'),
 ('Pascal', 45, 'Unknown', 'Unknown'),
 ('Dave', 12, 'Unknown', 'Unknown'),
 ('Emmy', 23, 'Unknown', 'Unknown')]

In [ ]:
# avoid vscode warning
result = ""

In [8]:
%%sql

result << SELECT * FROM Fam ORDER BY Age

 * sqlite:///databases/mydb.db
Done.
Returning data to local variable result

In [9]:
result

[('Dave', 12, 'Unknown', 'Unknown'),
 ('Emmy', 23, 'Unknown', 'Unknown'),
 ('Miranda', 32, 'Unknown', 'Unknown'),
 ('Pascal', 45, 'Unknown', 'Unknown'),
 ('Pam', 50, 'Unknown', 'Unknown')]

In [10]:
type(result)

sql.run.ResultSet

In [11]:
## SQLite runs in a local file and it can’t be closed. To be able to end the connection you can restart your kernel

# %sql -x / --close 'connection name'

In [12]:
# Another option

# import libraries
import pandas as pd
import sqlite3

# create a dataframe to import data for the tutorial
df= pd.DataFrame({'name': ['Juan', 'Victoria', 'Mary'], 
                  'age': [23,34,43], 
                  'city': ['Miami', 'Buenos Aires','Santiago']})

# We will sqlite3 library and create a connection
cnn = sqlite3.connect('databases/example.db')

df.to_sql('people', cnn)

%load_ext sql
%sql sqlite:///databases/example.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [34]:
%%sql
SELECT *
FROM people

   sqlite:///databases/mydb.db
 * sqlite:///example.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago')]